# input operations

# csv input

In [1]:
import pandas as pd
df = pd.read_csv('data.csv')
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

# csv output

In [14]:
import pandas as pd
df.to_csv('data.csv', index=False)

# excel input

In [3]:
import pandas as pd
df = pd.read_excel('student.xlsx')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    35 non-null     object
 2   class   35 non-null     object
 3   mark    35 non-null     int64
 4   gender  35 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB

# excel output

In [15]:
import pandas as pd
df.to_excel('data.xlsx', index=False)

# reading sql data

In [7]:
import pandas as pd
import sqlite3
connection = sqlite3.connect('mydatabase.db')
df = pd.read_sql('SELECT * FROM employees', connection)
df

   id     name  age   salary
0   1    Alice   30  50000.0
1   3  Charlie   25  45000.0

In [ ]:
writing sql data

In [16]:
import pandas as pd
import sqlite3
connection = sqlite3.connect('mydatabase.db')
df.to_sql('employees', connection, if_exists='replace', index=False)

150

# json file format reading

In [9]:
import pandas as pd
df = pd.read_json('iris.json')
df

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

# json writing

In [17]:
import pandas as pd
df.to_json('data.json')

# html

In [13]:
import pandas as pd

file_path =r"https://www.plus2net.com/python/download/student.html"

dfs = pd.read_html(file_path)
dfs

[    id         name  class  mark  gender
 0    1     John Deo   Four    75  female
 1    2     Max Ruin  Three    85    male
 2    3       Arnold  Three    55    male
 3    4   Krish Star   Four    60  female
 4    5    John Mike   Four    60  female
 5    6    Alex John   Four    55    male
 6    7  My John Rob   Five    78    male
 7    8       Asruid   Five    85    male
 8    9      Tes Qry    Six    78    male
 9   10     Big John   Four    55  female
 10  11       Ronald    Six    89  female
 11  12        Recky    Six    94  female
 12  13          Kty  Seven    88  female
 13  14         Bigy  Seven    88  female
 14  15     Tade Row   Four    88    male
 15  16        Gimmy   Four    88    male
 16  17        Tumyu    Six    54    male
 17  18        Honny   Five    75    male
 18  19        Tinny   Nine    18    male
 19  20       Jackly   Nine    65  female
 20  21   Babby John   Four    69  female
 21  22       Reggid  Seven    55  female
 22  23        Herod  Eight    79    male
 23  24    Tiddy Now  Seven    78    male
 24  25     Giff Tow    Six    88    male
 25  26       Crelea  Seven    79    male
 26  27     Big Nose  Three    81  female
 27  28    Rojj Base  Seven    86  female
 28  29  Tess Played  Seven    55    male
 29  30    Reppy Red    Six    79  female
 30  31  Marry Toeey   Four    88    male
 31  32    Binn Rott  Seven    90  female
 32  33    Kenn Rein    Six    96  female
 33  34     Gain Toe  Seven    69    male
 34  35   Rows Noump    Six    88  female]

In [18]:
import pandas as pd
df.to_clipboard()